---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorOrientation
source: html/ad457f4d-a384-5755-178e-0a749be26196.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorOrientation

Defines vector orientation for vector settings of analysis display style.

## Syntax (C#)
```csharp
public enum AnalysisDisplayStyleVectorOrientation
```